modules/common/src/test/resources/com/l7tech/common/resources/wcf_unum/04_cl_rst_sct_cancel.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><s:Header><a:Action s:mustUnderstand="1" u:Id="_1">http://schemas.xmlsoap.org/ws/2005/02/trust/RST/SCT/Cancel</a:Action><a:MessageID u:Id="_2">urn:uuid:da9f644e-4de1-4f0d-90ab-1d5a7ff124dd</a:MessageID><a:ReplyTo u:Id="_3"><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1" u:Id="_4">http://vinsanity:8082/layer7/wcfBookstore/buy</a:To><BookName a:IsReferenceParameter="true" xmlns="http://tempuri.org/">Book Title Three</BookName><o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><u:Timestamp u:Id="uuid-5ede9cd5-7c07-4258-b787-2ef6267e36b6-46"><u:Created>2011-01-04T22:49:35.204Z</u:Created><u:Expires>2011-01-04T22:54:35.204Z</u:Expires></u:Timestamp><c:SecurityContextToken u:Id="uuid-5d9c7de2-6432-4d72-b5ee-2f6a91ff2919-6" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc"><c:Identifier>urn:uuid:fcdfaf4e-798a-4071-b17b-ca882d2134b0</c:Identifier></c:SecurityContextToken><c:DerivedKeyToken u:Id="uuid-5ede9cd5-7c07-4258-b787-2ef6267e36b6-41" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc"><o:SecurityTokenReference><o:Reference ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/sct" URI="#uuid-5d9c7de2-6432-4d72-b5ee-2f6a91ff2919-6"/></o:SecurityTokenReference><c:Offset>0</c:Offset><c:Length>24</c:Length><c:Nonce>5GgYRjaGLAu1g33n+IQtDg==</c:Nonce></c:DerivedKeyToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/><Reference URI="#_0"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>IWo+ScDHtJwQyv3mP78JZPvR9fc=</DigestValue></Reference><Reference URI="#_1"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>GA0icwQsAzfUOq7Gy1Cg8CTTk6o=</DigestValue></Reference><Reference URI="#_2"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>4CMRhOl2NESIwkobIVDl1MyDo8w=</DigestValue></Reference><Reference URI="#_3"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>o3ibE52LCPwycD7dwAsKtJa+WMw=</DigestValue></Reference><Reference URI="#_4"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>Ie2TNesgdk9efxqlJczxZx0dRYU=</DigestValue></Reference><Reference URI="#uuid-5ede9cd5-7c07-4258-b787-2ef6267e36b6-46"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>9mZA9hj8qfsKTaAKEiZWf+YWjMA=</DigestValue></Reference></SignedInfo><SignatureValue>n3ZDFQxHRUnK5eJmO6ErLV/PS30=</SignatureValue><KeyInfo><o:SecurityTokenReference><o:Reference ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/dk" URI="#uuid-5ede9cd5-7c07-4258-b787-2ef6267e36b6-41"/></o:SecurityTokenReference></KeyInfo></Signature></o:Security></s:Header><s:Body u:Id="_0"><t:RequestSecurityToken xmlns:t="http://schemas.xmlsoap.org/ws/2005/02/trust"><t:RequestType>http://schemas.xmlsoap.org/ws/2005/02/trust/Cancel</t:RequestType><t:CancelTarget><o:SecurityTokenReference xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><o:Reference URI="urn:uuid:fcdfaf4e-798a-4071-b17b-ca882d2134b0" ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/sct"></o:Reference></o:SecurityTokenReference></t:CancelTarget></t:RequestSecurityToken></s:Body></s:Envelope>